In [1]:
import numpy as np
import pandas as pd
import os 
os.getcwd()

'C:\\Users\\yashd\\02. Velocity Class Notes\\Class\\3. Month 3\\Day - 48 Pandas Accessing Row, Col\\Practice'

In [2]:
arr = np.random.randint(1,15,[4,4])

In [3]:
df = pd.DataFrame(arr, columns=list("ABCD"), index = list("PQRS"))
df

    A   B   C   D
P  11  10  14  10
Q   8   8   2   8
R  12   1  14  13
S   6   7   4   9

In [4]:
emp_de = pd.read_excel('C:\\Users\\yashd\\02. Velocity Class Notes\\Class\\3. Month 3\\Day - 48 Pandas Accessing Row, Col\\Employee_Records.xlsx')

In [5]:
FFemp = emp_de.head()
FFemp

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont

### 3. Accessing Columns
- df_name["ColumnName"] --> single column

In [6]:
fist_series = FFemp["First Name"]

In [7]:
fist_series

0        Lois
1      Brenda
2         Joe
3       Diane
4    Benjamin
Name: First Name, dtype: object

In [8]:
type(fist_series)

pandas.core.series.Series

In [9]:
second_series = FFemp["Age in Yrs"]
second_series

0    36.36
1    47.02
2    54.15
3    39.67
4    40.31
Name: Age in Yrs, dtype: float64

In [10]:
second_series = FFemp[["Age in Yrs"]]
second_series

   Age in Yrs
0       36.36
1       47.02
2       54.15
3       39.67
4       40.31

In [11]:
type(second_series)

pandas.core.frame.DataFrame

In [12]:
second_series[0:4]

   Age in Yrs
0       36.36
1       47.02
2       54.15
3       39.67

In [13]:
second_series[::-1]

   Age in Yrs
4       40.31
3       39.67
2       54.15
1       47.02
0       36.36

## Accesing Multiple Columns
- df_name["ColumnNamelist"]

In [14]:
FFemp[["First Name", "Age in Yrs", "Weight in Kgs", "Age in Company", "Salary"]]

  First Name  Age in Yrs  Weight in Kgs  Age in Company  Salary
0       Lois       36.36             60           13.68  168251
1     Brenda       47.02             60            9.01   51063
2        Joe       54.15             68            0.98   50155
3      Diane       39.67             51           18.30  180294
4   Benjamin       40.31             58            4.01  117642

In [15]:
df = pd.DataFrame(arr, columns=list("ABCD"), index = list("PQRS"))
df

    A   B   C   D
P  11  10  14  10
Q   8   8   2   8
R  12   1  14  13
S   6   7   4   9

In [16]:
df["A"][0] = 143

In [17]:
df

     A   B   C   D
P  143  10  14  10
Q    8   8   2   8
R   12   1  14  13
S    6   7   4   9

In [18]:
df["A"] = 143

In [19]:
df

     A   B   C   D
P  143  10  14  10
Q  143   8   2   8
R  143   1  14  13
S  143   7   4   9

In [20]:
FFemp

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont

In [21]:
FFemp[0]

KeyError: 0

In [22]:
FFemp[0:1]

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver

In [23]:
df[0:1]

     A   B   C   D
P  143  10  14  10

In [24]:
df[0:1][2]

KeyError: 2

In [ ]:
df[2:3] = 1

In [ ]:
df

In [25]:
df[2:3]

     A  B   C   D
R  143  1  14  13

In [26]:
FFemp[0:2]

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall

## dfName.iloc([row, column])

In [27]:
df

     A   B   C   D
P  143  10  14  10
Q  143   8   2   8
R  143   1  14  13
S  143   7   4   9

In [28]:
df.iloc[0,0] = 12

In [29]:
df

     A   B   C   D
P   12  10  14  10
Q  143   8   2   8
R  143   1  14  13
S  143   7   4   9

In [30]:
df.iloc[0:2,0] = 5

In [31]:
df

     A   B   C   D
P    5  10  14  10
Q    5   8   2   8
R  143   1  14  13
S  143   7   4   9

In [32]:
df.iloc[2:3,2] = 50

In [33]:
df

     A   B   C   D
P    5  10  14  10
Q    5   8   2   8
R  143   1  50  13
S  143   7   4   9

In [34]:
df.iloc[0,2]

14

In [35]:
df.iloc[[0, 2], [0, 3]]

     A   D
P    5  10
R  143  13

In [36]:
df.iloc[[0, 2, 3], [0, 3, 2]]

     A   D   C
P    5  10  14
R  143  13  50
S  143   9   4

In [37]:
df

     A   B   C   D
P    5  10  14  10
Q    5   8   2   8
R  143   1  50  13
S  143   7   4   9

In [53]:
df.loc[ ["P","Q"], ["A","B", "D"] ]

   A   B   D
P  5  10  10
Q  5   8   8